<a href="https://colab.research.google.com/github/SuperDataWorld/Python/blob/main/QCut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
import pandas as pd

In [26]:
name = ['John','Paul','Jane','Mike','Tony','Mary','Ben','Lynda','Lynne','Tory','Adrian']
score = list(range(0,110,10))
df = pd.DataFrame({'name':name, 'score':score})
df

      name  score
0     John      0
1     Paul     10
2     Jane     20
3     Mike     30
4     Tony     40
5     Mary     50
6      Ben     60
7    Lynda     70
8    Lynne     80
9     Tory     90
10  Adrian    100

In [27]:
pd.qcut(df.score,4)

0     (-0.001, 25.0]
1     (-0.001, 25.0]
2     (-0.001, 25.0]
3       (25.0, 50.0]
4       (25.0, 50.0]
5       (25.0, 50.0]
6       (50.0, 75.0]
7       (50.0, 75.0]
8      (75.0, 100.0]
9      (75.0, 100.0]
10     (75.0, 100.0]
Name: score, dtype: category
Categories (4, interval[float64]): [(-0.001, 25.0] < (25.0, 50.0] < (50.0, 75.0] < (75.0, 100.0]]

In [28]:
df['Quartile'] = pd.qcut(df['score'],4,['1stQ','2ndQ','3rdQ','4thQ'])
df

      name  score Quartile
0     John      0     1stQ
1     Paul     10     1stQ
2     Jane     20     1stQ
3     Mike     30     2ndQ
4     Tony     40     2ndQ
5     Mary     50     2ndQ
6      Ben     60     3rdQ
7    Lynda     70     3rdQ
8    Lynne     80     4thQ
9     Tory     90     4thQ
10  Adrian    100     4thQ

In [29]:
df[df['Quartile'] == '4thQ']

      name  score Quartile
8    Lynne     80     4thQ
9     Tory     90     4thQ
10  Adrian    100     4thQ

In [30]:
pd.get_dummies(df, columns=df.columns[2:])

      name  score  Quartile_1stQ  Quartile_2ndQ  Quartile_3rdQ  Quartile_4thQ
0     John      0              1              0              0              0
1     Paul     10              1              0              0              0
2     Jane     20              1              0              0              0
3     Mike     30              0              1              0              0
4     Tony     40              0              1              0              0
5     Mary     50              0              1              0              0
6      Ben     60              0              0              1              0
7    Lynda     70              0              0              1              0
8    Lynne     80              0              0              0              1
9     Tory     90              0              0              0              1
10  Adrian    100              0              0              0              1